blog-hugo/content/posts/dr-strange-critique.md
---
title: "Dr Strange: Movie of madness"
date: 2022-05-31
tags: ["movies", "opinion", "spoilers"]
draft: false
---

I recently, like a lot of people, watched the new Dr Strange movie. I found
it... underwhelming to say the least. Even though it looked great I left that
movie hall feeling like I just watched an underused mess. It was almost not as
fun as having to deal with the ire of my family, as I was the one who chose the
movie...

BTW this is an adaptation from a long discord message I posted in the [doom emacs
discord server](https://doomemacs.org/discord) so... Hi Lejon! I guess.


#### **Spoilers ahead, you have been warned** {#spoilers-ahead-you-have-been-warned}


## The movie {#the-movie}

In a word it felt like an underused cobbled together mess.
I watched it in 2D, this meant that I did not get the face punching 3d affects
and most of the spectacle of the story was squarely on the story (though the
movie still looked great). I think with better writing not only would the themes
and concepts have felt more solid but we would have more use (and proper use) of
characters.

The villain introduction relied on you watching Wanda Vision for the arc to make
sense, otherwise if you are a casual, coming straight from endgame it felt very
much out of left field.

Characters that were teased at in the first Dr Strange, principally Mordo, a
character who was teased as the villain for the sequel was not even shown. We
instead get a Mordo that is not the one that has been built up and is then
thrown away after a mild fist fight with little resolution to what he means to
Strange. This lack of continuity from its principal prequel felt like a pressure
release valve going off. All bets are off and all tension is cut. This will not
translate over to any third movie as it would have been too long. the first
movie was released in 2016... 6 years ago. another movie will not be coming for a
while and by that time at least my psyche would have moved on. Mordo and his
build up would have been wasted.

The Illuminati (why the illuminati??) present in universe 838 were comprised of the
first cannon introductions of both the Fantastic Four and the Xmen in the MCU
(M?) both of which were over very quickly on screen, it felt like "oh this is a
thing that will be coming in the later movies but we want to tease it now". Then
you also have Peggy Carter as Captain Britain (or whatever), principally a call
back to What If but if you did not watch that, it was a gag. A lesser example of
the problem I had with Wanda's arc.


## Themes from a box {#themes-from-a-box}

Themes are presented such as happiness, motherhood, loss and confidence.
None of these felt explored in any satisfactory way.
Happiness was not really dealt with, Strange was just kinda asked "are you
happy?" and lied through his teeth, this then came up near the end as well when
evil Strange number 3 asked the same question and then they started fighting
with music notes. It was kinda resolved with the monologue to 838 Christine but
in a cheesy way, not in anything that felt good for the character. It felt like
the cliche line and a cliche theme that did not do much for our character. I
feel like the movie would not have been different if it was not included.

Motherhood was better in this regard. It gave Wanda's sacrifice weight in a
sense and was played in little bits though out the movie, as she dreamed and dream
walked. It added to her ending seeing her actions come to a head and see how she
will never be a mother to any child she abducts. It was a good scene and a good
theme.

Confidence on the other hand while being intertwined with happiness also takes a
lot of traits from it (not really but the parallels are there). it did not feel
dealt with in any real sense though out the movie and it just came to the head
that was the power of friendship ending where the protagonist learns to believe
in themselves and then girlbosses scarlet witch. It felt rushed with no real
build up.


## Multiverse of... not much? {#multiverse-of-dot-dot-dot-not-much}

The concept of multiverse was very much underused with us not getting a chance
to really see it. This does not mean I want to see a massive amount of
universes but want to see _the concept_. Otherwise it does not become a
distinct thing, a concept the movie plays with, but a plot device that does
nothing but give our characters reason to move (editor's note: a MacGuffin
(Thanks Lejon)), as well as fuel this power of
love story ending (I know its not actually a power of love ending, I am taking a
little bit of piss)
Some may say It was never explained in any real way which reflects
the unknown nature of it to our protagonists, but even still with this it does
not feel distinct in any meaningful way


## What this says about the MCU {#what-this-says-about-the-mcu}

This speaks to a bigger problem I saw in endgame but think this movie
exemplifies, The MCU has gotten too big to be cohesive. Most of the movie felt
like callbacks, teasers and set up with actual substance being lost. It leads to
a movie that felt hollow in many senses, gravity has been lost and points of
interest have become little more than lore points for the overall arc in
phase 5. As it grows if you want to stay in the loop and understand most movies
fully, you need to watch everything that comes before, its getting to the point
where there are entire sub markets writing up plot summaries so that you can
understand the movie. This essentially excludes the casual from the franchises
they enjoy, People may only tune in for the movies they care about (for me those
being the spiderman and Dr Strange and maybe Thor) they are left out. Now I
could go on about how this is all to drive up profit and coerce people into
going to every movie and watching all the shows on Disney+ but that's for another
day.

Part of the magic of the first set of movies was that it was a small rag tag
team that had there own introductions, each movie added context but also did not
become required reading to understand in full.

Endgame was the beginning of this. This movie is the beginning of the end.
